data/tests/json/c_3p_500_5.txt
Run 1:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      500
Time taken for tests:   17.579 seconds
Complete requests:      5000
Failed requests:        1184
   (Connect: 0, Receive: 592, Length: 592, Exceptions: 0)
Total transferred:      577448 bytes
Total body sent:        880000
HTML transferred:       101384 bytes
Requests per second:    284.42 [#/sec] (mean)
Time per request:       1757.937 [ms] (mean)
Time per request:       3.516 [ms] (mean, across all concurrent requests)
Transfer rate:          32.08 [Kbytes/sec] received
                        48.89 kb/s sent
                        80.96 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       26  192 131.9    163    2848
Processing:    50  780 1628.8    214   15552
Waiting:        0  621 1370.9    138   15020
Total:         79  972 1631.6    429   15856

Percentage of the requests served within a certain time (ms)
  50%    429
  66%    598
  75%    846
  80%   1110
  90%   2129
  95%   3470
  98%   6815
  99%   9294
 100%  15856 (longest request)
Run 2:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      500
Time taken for tests:   19.124 seconds
Complete requests:      5000
Failed requests:        1206
   (Connect: 0, Receive: 603, Length: 603, Exceptions: 0)
Total transferred:      576007 bytes
Total body sent:        880000
HTML transferred:       101131 bytes
Requests per second:    261.45 [#/sec] (mean)
Time per request:       1912.385 [ms] (mean)
Time per request:       3.825 [ms] (mean, across all concurrent requests)
Transfer rate:          29.41 [Kbytes/sec] received
                        44.94 kb/s sent
                        74.35 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       21  200 186.9    148    2858
Processing:    50  794 1723.8    228   15570
Waiting:        0  638 1446.6    135   14999
Total:         72  993 1730.8    432   15822

Percentage of the requests served within a certain time (ms)
  50%    432
  66%    603
  75%    853
  80%   1118
  90%   2122
  95%   3645
  98%   6575
  99%  10360
 100%  15822 (longest request)
Run 3:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      500
Time taken for tests:   130.934 seconds
Complete requests:      5000
Failed requests:        1266
   (Connect: 0, Receive: 632, Length: 634, Exceptions: 0)
Total transferred:      571946 bytes
Total body sent:        880000
HTML transferred:       100418 bytes
Requests per second:    38.19 [#/sec] (mean)
Time per request:       13093.391 [ms] (mean)
Time per request:       26.187 [ms] (mean, across all concurrent requests)
Transfer rate:          4.27 [Kbytes/sec] received
                        6.56 kb/s sent
                        10.83 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  211 196.6    166    5352
Processing:    50 1080 3358.9    252  120426
Waiting:        0  868 2209.9    147   39274
Total:         80 1291 3360.5    456  120426

Percentage of the requests served within a certain time (ms)
  50%    456
  66%    679
  75%   1074
  80%   1429
  90%   2924
  95%   4834
  98%   9123
  99%  12121
 100%  120426 (longest request)
Run 4:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      500
Time taken for tests:   128.950 seconds
Complete requests:      5000
Failed requests:        1175
   (Connect: 0, Receive: 585, Length: 590, Exceptions: 0)
Total transferred:      577841 bytes
Total body sent:        880000
HTML transferred:       101453 bytes
Requests per second:    38.77 [#/sec] (mean)
Time per request:       12895.036 [ms] (mean)
Time per request:       25.790 [ms] (mean, across all concurrent requests)
Transfer rate:          4.38 [Kbytes/sec] received
                        6.66 kb/s sent
                        11.04 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  195 138.3    147    2850
Processing:    46  921 4042.7    207  120446
Waiting:        0  655 1983.1    137   66668
Total:         66 1116 4039.3    436  120446

Percentage of the requests served within a certain time (ms)
  50%    436
  66%    592
  75%    832
  80%   1079
  90%   2230
  95%   3589
  98%   7250
  99%  10511
 100%  120446 (longest request)
Run 5:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)
Total of 4316 requests completed
Run 1:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      500
Time taken for tests:   129.617 seconds
Complete requests:      5000
Failed requests:        1262
   (Connect: 0, Receive: 630, Length: 632, Exceptions: 0)
Total transferred:      572208 bytes
Total body sent:        880000
HTML transferred:       100464 bytes
Requests per second:    38.58 [#/sec] (mean)
Time per request:       12961.702 [ms] (mean)
Time per request:       25.923 [ms] (mean, across all concurrent requests)
Transfer rate:          4.31 [Kbytes/sec] received
                        6.63 kb/s sent
                        10.94 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  208 196.9    169    5523
Processing:    59  976 3501.7    237  120909
Waiting:        0  762 2339.2    153   58826
Total:         77 1185 3503.7    466  120909

Percentage of the requests served within a certain time (ms)
  50%    466
  66%    649
  75%    910
  80%   1314
  90%   2334
  95%   3979
  98%   7348
  99%  11102
 100%  120909 (longest request)
Run 2:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      500
Time taken for tests:   129.494 seconds
Complete requests:      5000
Failed requests:        1363
   (Connect: 0, Receive: 644, Length: 719, Exceptions: 0)
Total transferred:      570505 bytes
Total body sent:        880000
HTML transferred:       100165 bytes
Requests per second:    38.61 [#/sec] (mean)
Time per request:       12949.436 [ms] (mean)
Time per request:       25.899 [ms] (mean, across all concurrent requests)
Transfer rate:          4.30 [Kbytes/sec] received
                        6.64 kb/s sent
                        10.94 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  206 205.2    158    5335
Processing:    59  826 2457.6    235  120839
Waiting:        0  649 1599.8    140   38035
Total:         76 1031 2465.6    444  120839

Percentage of the requests served within a certain time (ms)
  50%    444
  66%    630
  75%    899
  80%   1236
  90%   2216
  95%   3560
  98%   6393
  99%   9015
 100%  120839 (longest request)
Run 3:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      500
Time taken for tests:   129.034 seconds
Complete requests:      5000
Failed requests:        1184
   (Connect: 0, Receive: 586, Length: 598, Exceptions: 0)
Total transferred:      577317 bytes
Total body sent:        880000
HTML transferred:       101361 bytes
Requests per second:    38.75 [#/sec] (mean)
Time per request:       12903.432 [ms] (mean)
Time per request:       25.807 [ms] (mean, across all concurrent requests)
Transfer rate:          4.37 [Kbytes/sec] received
                        6.66 kb/s sent
                        11.03 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  193 117.8    167    2849
Processing:    45  926 4764.6    225  120869
Waiting:        0  629 1526.5    150   26191
Total:         75 1119 4758.0    444  120869

Percentage of the requests served within a certain time (ms)
  50%    444
  66%    590
  75%    837
  80%   1029
  90%   2107
  95%   3487
  98%   6421
  99%  10085
 100%  120869 (longest request)
Run 4:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)
Total of 4894 requests completed
Run 5:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      500
Time taken for tests:   129.532 seconds
Complete requests:      5000
Failed requests:        1237
   (Connect: 0, Receive: 614, Length: 623, Exceptions: 0)
Total transferred:      574042 bytes
Total body sent:        880000
HTML transferred:       100786 bytes
Requests per second:    38.60 [#/sec] (mean)
Time per request:       12953.241 [ms] (mean)
Time per request:       25.906 [ms] (mean, across all concurrent requests)
Transfer rate:          4.33 [Kbytes/sec] received
                        6.63 kb/s sent
                        10.96 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  209 212.0    172    7849
Processing:    73  824 3722.6    223  121301
Waiting:        0  591 1302.6    134   23586
Total:        116 1033 3722.6    435  121301

Percentage of the requests served within a certain time (ms)
  50%    435
  66%    612
  75%    865
  80%   1226
  90%   2078
  95%   3293
  98%   5179
  99%   8130
 100%  121301 (longest request)